TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_i2c_driver.c
/*
 * stm32h7sxx_i2c_driver.c
 *
 *  Created on: Jun 4, 2026
 *      Author: talha
 */

#include "stm32h7sxx_i2c_driver.h"
#include <stdio.h>

//Helper prototoypes
static void I2C_ClearCR2TransferFields(I2C_RegDef_t *pI2Cx);
static uint8_t I2C_CheckAndClearErrors(I2C_RegDef_t *pI2Cx);
static uint8_t I2C_WaitOnFlagUntilTimeout(I2C_RegDef_t *pI2Cx, uint32_t FlagName, uint8_t DesiredStatus, uint32_t Timeout);
static void I2C_ConfigTransfer(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr, uint8_t Direction, uint32_t NBytes, uint8_t Reload, uint8_t AutoEnd);

/*
 * I2C Peripheral Clock Control
 */

/****************************************************************************
 * @fn				- I2C_PeriClockControl
 *
 * @brief			- This function enables or disables peripheral clock for I2Cx
 *
 * @param[in]		- base address of the I2C Peripheral
 * @param[in]		- ENABLE or DISABLE macros
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- none
 * 					-
 *					-
 *
 */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t ENorDI)
{
    if (ENorDI == ENABLE)
    {
        if (pI2Cx == I2C1) {
            I2C1_PCLK_EN();
        } else if (pI2Cx == I2C2) {
            I2C2_PCLK_EN();
        } else if (pI2Cx == I2C3) {
            I2C3_PCLK_EN();
        }
    }
    else if(ENorDI == DISABLE)
    {
        if (pI2Cx == I2C1) {
            I2C1_PCLK_DI();
        } else if (pI2Cx == I2C2) {
            I2C2_PCLK_DI();
        } else if (pI2Cx == I2C3) {
            I2C3_PCLK_DI();
        }
    } else{
    	//Return error
    }
}

/*
 * I2C Init - DeInıt
 */
/****************************************************************************
 * @fn              - I2C_Init
 *
 * @brief           - This function initializes the I2C peripheral
 *
 * @param[in]       - pI2CHandle: I2C handle structure with base address
 *                    and configuration
 *
 * @return          - none
 *
 * @Note            - I2C timing, filter and own address configuration must be
 *                    done while PE = 0.
 *
 *                  - I2C_DeviceAddress is the STM32 own address.
 *                    If STM32 is used only as master, this can be 0.
 *                    If STM32 is used as slave, set a valid own address.
 *
 */
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
    uint32_t tempreg = 0;

    if ((pI2CHandle == NULL) || (pI2CHandle->pI2Cx == NULL))
    {
        // Invalid handle
        return;
    }

    //Enable peripheral clock
    I2C_PeriClockControl(pI2CHandle->pI2Cx, ENABLE);

    /*
     * Disable I2C peripheral before configuration (TIMINGR, filters and own address must be configured while PE = 0.)
     */
    I2C_PeripheralControl(pI2CHandle->pI2Cx, DISABLE);
    while (pI2CHandle->pI2Cx->CR1 & (1U << I2C_CR1_PE));

    /*
     * Configure filters
     * DNF[3:0] = 0000 : Digital filter disabled
     * ANFOFF   = 0    : Analog filter enabled
     */
    pI2CHandle->pI2Cx->CR1 &= ~(0xFU << I2C_CR1_DNF);
    pI2CHandle->pI2Cx->CR1 &= ~(1U << I2C_CR1_ANFOFF);

    /*
     * Disable target byte control mode for basic I2C operation.
     * SBC is only needed for byte-by-byte ACK control in target receiver mode.
     */
    pI2CHandle->pI2Cx->CR1 &= ~(1U << I2C_CR1_SBC);

    //Configure TIMINGR This value must be generated by CubeMX
    pI2CHandle->pI2Cx->TIMINGR = pI2CHandle->I2C_Config.I2C_Timing;

    //Configure NOSTRETCH
    if (pI2CHandle->I2C_Config.I2C_NoStretchMode == I2C_STRETCH_DISABLE){
		pI2CHandle->pI2Cx->CR1 |= (1U << I2C_CR1_NOSTRETCH);
	} else{
		pI2CHandle->pI2Cx->CR1 &= ~(1U << I2C_CR1_NOSTRETCH);
	}

    /*
     * Disable hardware timeout feature for normal I2C usage
     * For Timeout settings see @fn - I2C_WaitOnFlagUntilTimeout in HELPERS section
     */
    pI2CHandle->pI2Cx->TIMEOUTR = 0U;

    /*
     * Configure own address
     *
     * Own address is only needed when STM32 works as an I2C slave/target.
     *
     * If I2C_DeviceAddress == 0:
     *      Own address is not configured.
     *
     * If I2C_DeviceAddress != 0:
     *      OAR1 is configured and enabled.
     */
    pI2CHandle->pI2Cx->OAR1 = 0U;

    if (pI2CHandle->I2C_Config.I2C_DeviceAddress != 0U)
    {
        if (pI2CHandle->I2C_Config.I2C_AddressingMode == I2C_ADDRMODE_7BIT)
        {
        	// 7-bit own address mode
            tempreg |= ((uint32_t)(pI2CHandle->I2C_Config.I2C_DeviceAddress & 0x7FU) << 1U);
        }
        else
        {
            // 10-bit own address mode
            tempreg |= ((uint32_t)(pI2CHandle->I2C_Config.I2C_DeviceAddress & 0x3FFU) << I2C_OAR1_OA1);
            tempreg |= (1U << I2C_OAR1_OA1MODE);
        }

        //Enable own address 1
        tempreg |= (1U << I2C_OAR1_OA1EN);

        pI2CHandle->pI2Cx->OAR1 = tempreg;
    }

    //Enable I2C peripheral
    I2C_PeripheralControl(pI2CHandle->pI2Cx, ENABLE);
}

/****************************************************************************
 * @fn				- I2C_DeInıt
 *
 * @brief			- This function resets the selected I2C peripheral
 *
 * @param[in]		- pI2Cx: base address of the I2C peripheral
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Reset bit must be set and then cleared.
 * 					- If the bit stays set, the peripheral remains in reset.
 *					-
 *
 */
void I2C_DeInit(I2C_RegDef_t *pI2Cx){
	if (pI2Cx == I2C1)
    {
		//Reset all I2C1 registers
		RCC->APB1RSTR1 |=  (1U << 21);
        RCC->APB1RSTR1 &= ~(1U << 21);
    }
    else if (pI2Cx == I2C2)
    {
    	//Reset all I2C2 registers
        RCC->APB1RSTR1 |=  (1U << 22);
        RCC->APB1RSTR1 &= ~(1U << 22);
    }
    else if (pI2Cx == I2C3)
    {
    	//Reset all I2C3 registers
        RCC->APB1RSTR1 |=  (1U << 23);
        RCC->APB1RSTR1 &= ~(1U << 23);
    }
}

/*
 * Peripheral Control
 */
/****************************************************************************
 * @fn				- I2C_PeripheralControl
 *
 * @brief			- This function enables or disables I2Cx peripheral
 *
 * @param[in]		- I2C Base address
 * @param[in]		- Enable or Disable Macros
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- none
 * 					-
 *					-
 *
 */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t ENorDI){
	if(ENorDI == ENABLE){
		pI2Cx->CR1 |= (SET << I2C_CR1_PE);
	}else if(ENorDI == DISABLE){
		pI2Cx->CR1 &= ~(SET << I2C_CR1_PE);
	}else{
		//Return error
	}
}

