TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_i2c_driver.c
/*
 * Data Send - Receive: Blocking Master APIs
 */
/****************************************************************************
 * @fn              - I2C_MasterSendData
 *
 * @brief           - This function sends data in master mode using blocking method
 *
 * @param[in]       - pI2CHandle: I2C handle structure
 * @param[in]       - pTxBuffer: pointer to transmit buffer
 * @param[in]       - Len: number of bytes to transmit
 * @param[in]       - SlaveAddr: 7-bit slave address
 *
 * @return          - none
 *
 * @Note            - This function supports transfers longer than 255 bytes using RELOAD mode.
 *
 */
uint8_t I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr){
	I2C_RegDef_t *pI2Cx = NULL;
	uint32_t bytes_to_send;
	uint8_t status;

	//Argument check
    if ((pI2CHandle == NULL) || (pI2CHandle->pI2Cx == NULL) || (pTxBuffer == NULL) || (Len == 0U)){
        return I2C_ERROR_INVALID_ARG;
    }

	pI2Cx = pI2CHandle->pI2Cx;

	status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
										I2C_FLAG_BUSY,
										FLAG_RESET,
										I2C_TIMEOUT);

	if(status != I2C_OK){
		return status;
	}

	bytes_to_send = (Len > 255U) ? 255U : Len;

    I2C_ConfigTransfer(pI2Cx,
                       SlaveAddr,
                       I2C_DIR_WRITE,
                       bytes_to_send,
                       (Len > 255U) ? ENABLE : DISABLE,
                       (Len > 255U) ? DISABLE : ENABLE);

	//Generate START
	pI2Cx->CR2 |= (1U << I2C_CR2_START);

	//Send bytes
	while(Len > 0U){
	   status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
											I2C_FLAG_TXIS,
											FLAG_SET,
											I2C_TIMEOUT);

		if(status != I2C_OK){
			return status;
		}

		//Send the message to TX Data Register
		pI2Cx->TXDR = *pTxBuffer;
		pTxBuffer++;
		Len--;
		bytes_to_send--;

		if((bytes_to_send == 0U) && (Len > 0U)){
            status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                                I2C_FLAG_TCR,
                                                FLAG_SET,
                                                I2C_TIMEOUT);
    		if(status != I2C_OK){
    			return status;
    		}

            bytes_to_send = (Len > 255U) ? 255U : Len;

            pI2Cx->CR2 &= ~(0xFFU << I2C_CR2_NBYTES);
            pI2Cx->CR2 |= ((bytes_to_send & 0xFFU) << I2C_CR2_NBYTES);

            if (Len > 255U){
                pI2Cx->CR2 |= (1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 &= ~(1U << I2C_CR2_AUTOEND);
            } else{
                pI2Cx->CR2 &= ~(1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 |= (1U << I2C_CR2_AUTOEND);
            }
		}
	}


	//Wait until STOP
    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_STOPF,
                                        FLAG_SET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

	//Clear Stop Flag
	pI2Cx->ICR |= (1U << I2C_ICR_STOPCF);

	return I2C_OK;
}

/****************************************************************************
 * @fn              - I2C_MasterReceiveData
 *
 * @brief           - This function receives data in master mode using blocking method
 *
 * @param[in]       - pI2CHandle: I2C handle structure
 * @param[in]       - pRxBuffer: pointer to receive buffer
 * @param[in]       - Len: number of bytes to receive
 * @param[in]       - SlaveAddr: 7-bit slave address
 *
 * @return          - none
 *
 * @Note            - This function supports transfers longer than 255 bytes using RELOAD mode.
 *
 */
uint8_t I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr){
    I2C_RegDef_t *pI2Cx;
	uint32_t bytes_to_read;
	uint8_t status;

	//Argument check
	if ((pI2CHandle == NULL) || (pI2CHandle->pI2Cx == NULL) || (pRxBuffer == NULL) || (Len == 0U)) {
		return I2C_ERROR_INVALID_ARG;
	}

	pI2Cx = pI2CHandle->pI2Cx;

	status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
										I2C_FLAG_BUSY,
										FLAG_RESET,
										I2C_TIMEOUT);
	if (status != I2C_OK){
		return status;
	}

	bytes_to_read = (Len > 255U) ? 255U : Len;

	I2C_ConfigTransfer(pI2Cx,
					   SlaveAddr,
					   I2C_DIR_READ,
					   bytes_to_read,
					   (Len > 255U) ? ENABLE : DISABLE,
					   (Len > 255U) ? DISABLE : ENABLE);

	pI2Cx->CR2 |= (1U << I2C_CR2_START);

	//Read bytes
	while (Len > 0U){
		status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
											I2C_FLAG_RXNE,
											FLAG_SET,
											I2C_TIMEOUT);
		if (status != I2C_OK){
			return status;
		}

		*pRxBuffer = (uint8_t)pI2Cx->RXDR;
		pRxBuffer++;
		Len--;
		bytes_to_read--;

		if ((bytes_to_read == 0U) && (Len > 0U)){
			status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
												I2C_FLAG_TCR,
												FLAG_SET,
												I2C_TIMEOUT);
			if (status != I2C_OK){
				return status;
			}

			bytes_to_read = (Len > 255U) ? 255U : Len;

			pI2Cx->CR2 &= ~(0xFFU << I2C_CR2_NBYTES);
			pI2Cx->CR2 |= ((bytes_to_read & 0xFFU) << I2C_CR2_NBYTES);

			if (Len > 255U){
				pI2Cx->CR2 |= (1U << I2C_CR2_RELOAD);
				pI2Cx->CR2 &= ~(1U << I2C_CR2_AUTOEND);
			} else{
				pI2Cx->CR2 &= ~(1U << I2C_CR2_RELOAD);
				pI2Cx->CR2 |= (1U << I2C_CR2_AUTOEND);
			}
		}
	}

	status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
										I2C_FLAG_STOPF,
										FLAG_SET,
										I2C_TIMEOUT);
	if (status != I2C_OK){
		return status;
	}

	pI2Cx->ICR |= (1U << I2C_ICR_STOPCF);

	return I2C_OK;
}

/*
 * Data Send - Receive: Blocking Slave APIs
 */
/****************************************************************************
 * @fn              - I2C_SlaveSendData
 *
 * @brief           - This function writes one byte to TXDR in slave mode
 *
 * @param[in]       - pI2Cx: base address of the I2C peripheral
 * @param[in]       - data: byte to be transmitted
 *
 * @return          - none
 *
 * @Note            - Usually called when TXIS flag is set.
 *
 */
void I2C_SlaveSendData(I2C_RegDef_t *pI2Cx, uint8_t data){
	if(pI2Cx == NULL){
		//Return error
		return;
	}

	//Send bytes
	pI2Cx->TXDR = data;
}

/****************************************************************************
 * @fn              - I2C_SlaveReceiveData
 *
 * @brief           - This function reads one byte from RXDR in slave mode
 *
 * @param[in]       - pI2Cx: base address of the I2C peripheral
 *
 * @return          - received byte
 *
 * @Note            - Usually called when RXNE flag is set.
 *
 */
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2Cx){
	if(pI2Cx == NULL){
		//Return error
		return 0;
	}

	return(uint8_t)pI2Cx->RXDR;
}

