TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_i2c_driver.c
/*
 * Memory/Register Read-Write APIs
 */
/****************************************************************************
 * @fn              - I2C_MemWrite
 *
 * @brief           - This function writes data to a target register/memory address
 *
 * @param[in]       - pI2CHandle: I2C handle structure
 * @param[in]       - SlaveAddr: 7-bit slave address
 * @param[in]       - RegAddr: target register address
 * @param[in]       - pTxBuffer: pointer to data buffer
 * @param[in]       - Len: number of data bytes
 *
 * @return          - none
 *
 * @Note            - This function supports 8-bit register addresses.
 *
 */
uint8_t I2C_MemWrite(I2C_Handle_t *pI2CHandle, uint8_t SlaveAddr, uint8_t RegAddr, uint8_t *pTxBuffer, uint32_t Len){
    I2C_RegDef_t *pI2Cx;
    uint32_t total_len;
    uint32_t bytes_to_send;
    uint8_t reg_sent = 0U;
    uint8_t status;

    //Argument check
    if ((pI2CHandle == NULL) || (pI2CHandle->pI2Cx == NULL) || (pTxBuffer == NULL) || (Len == 0U)) {
        return I2C_ERROR_INVALID_ARG;
    }

    pI2Cx = pI2CHandle->pI2Cx;

    total_len = Len + 1U;   // register address byte + data bytes

    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_BUSY,
                                        FLAG_RESET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    bytes_to_send = (total_len > 255U) ? 255U : total_len;

    I2C_ConfigTransfer(pI2Cx,
                       SlaveAddr,
                       I2C_DIR_WRITE,
                       bytes_to_send,
                       (total_len > 255U) ? ENABLE : DISABLE,
                       (total_len > 255U) ? DISABLE : ENABLE);

    pI2Cx->CR2 |= (1U << I2C_CR2_START);

    while (total_len > 0U){
        status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                            I2C_FLAG_TXIS,
                                            FLAG_SET,
                                            I2C_TIMEOUT);
        if (status != I2C_OK){
            return status;
        }

        if (reg_sent == 0U){
            pI2Cx->TXDR = RegAddr;
            reg_sent = 1U;
        } else{
            pI2Cx->TXDR = *pTxBuffer;
            pTxBuffer++;
        }

        total_len--;
        bytes_to_send--;

        if ((bytes_to_send == 0U) && (total_len > 0U)){
            status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                                I2C_FLAG_TCR,
                                                FLAG_SET,
                                                I2C_TIMEOUT);
            if (status != I2C_OK){
                return status;
            }

            bytes_to_send = (total_len > 255U) ? 255U : total_len;

            pI2Cx->CR2 &= ~(0xFFU << I2C_CR2_NBYTES);
            pI2Cx->CR2 |= ((bytes_to_send & 0xFFU) << I2C_CR2_NBYTES);

            if (total_len > 255U){
                pI2Cx->CR2 |= (1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 &= ~(1U << I2C_CR2_AUTOEND);
            } else{
                pI2Cx->CR2 &= ~(1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 |= (1U << I2C_CR2_AUTOEND);
            }
        }
    }

    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_STOPF,
                                        FLAG_SET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    pI2Cx->ICR |= (1U << I2C_ICR_STOPCF);

    return I2C_OK;
}

/****************************************************************************
 * @fn              - I2C_MemRead
 *
 * @brief           - This function reads data from a target register/memory address
 *
 * @param[in]       - pI2CHandle: I2C handle structure
 * @param[in]       - SlaveAddr: 7-bit slave address
 * @param[in]       - RegAddr: target register address
 * @param[in]       - pRxBuffer: pointer to receive buffer
 * @param[in]       - Len: number of bytes to read
 *
 * @return          - none
 *
 * @Note            - This function uses repeated START.
 *                    It supports 8-bit register addresses
 *
 */
uint8_t I2C_MemRead(I2C_Handle_t *pI2CHandle, uint8_t SlaveAddr, uint8_t RegAddr, uint8_t *pRxBuffer, uint32_t Len){
    I2C_RegDef_t *pI2Cx;
    uint32_t bytes_to_read;
    uint8_t status;

    if ((pI2CHandle == NULL) || (pI2CHandle->pI2Cx == NULL) || (pRxBuffer == NULL) || (Len == 0U)){
        return I2C_ERROR_INVALID_ARG;
    }

    pI2Cx = pI2CHandle->pI2Cx;

    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_BUSY,
                                        FLAG_RESET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    /*
     * Send register address.
     * AUTOEND = 0, repeated START without STOP
     */
    I2C_ConfigTransfer(pI2Cx,
                       SlaveAddr,
                       I2C_DIR_WRITE,
                       1U,
                       DISABLE,
                       DISABLE);

    pI2Cx->CR2 |= (1U << I2C_CR2_START);

    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_TXIS,
                                        FLAG_SET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    pI2Cx->TXDR = RegAddr;

    /*
     * TC means the register-address write phase is complete,
     */
    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_TC,
                                        FLAG_SET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    /*
     * Read data using RELOAD if Len > 255.
     */
    bytes_to_read = (Len > 255U) ? 255U : Len;

    I2C_ConfigTransfer(pI2Cx,
                       SlaveAddr,
                       I2C_DIR_READ,
                       bytes_to_read,
                       (Len > 255U) ? ENABLE : DISABLE,
                       (Len > 255U) ? DISABLE : ENABLE);

    pI2Cx->CR2 |= (1U << I2C_CR2_START);

    while (Len > 0U){
        status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                            I2C_FLAG_RXNE,
                                            FLAG_SET,
                                            I2C_TIMEOUT);
        if (status != I2C_OK){
            return status;
        }

        *pRxBuffer = (uint8_t)pI2Cx->RXDR;
        pRxBuffer++;
        Len--;
        bytes_to_read--;

        if ((bytes_to_read == 0U) && (Len > 0U)){
            status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                                I2C_FLAG_TCR,
                                                FLAG_SET,
                                                I2C_TIMEOUT);
            if (status != I2C_OK){
                return status;
            }

            bytes_to_read = (Len > 255U) ? 255U : Len;

            pI2Cx->CR2 &= ~(0xFFU << I2C_CR2_NBYTES);
            pI2Cx->CR2 |= ((bytes_to_read & 0xFFU) << I2C_CR2_NBYTES);

            if (Len > 255U){
                pI2Cx->CR2 |= (1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 &= ~(1U << I2C_CR2_AUTOEND);
            } else{
                pI2Cx->CR2 &= ~(1U << I2C_CR2_RELOAD);
                pI2Cx->CR2 |= (1U << I2C_CR2_AUTOEND);
            }
        }
    }

