TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_i2c_driver.c
    status = I2C_WaitOnFlagUntilTimeout(pI2Cx,
                                        I2C_FLAG_STOPF,
                                        FLAG_SET,
                                        I2C_TIMEOUT);
    if (status != I2C_OK){
        return status;
    }

    pI2Cx->ICR |= (1U << I2C_ICR_STOPCF);

    return I2C_OK;
}

/*
 * Get Flag Status
 */
/****************************************************************************
 * @fn              - I2C_GetFlagStatus
 *
 * @brief           - This function checks whether a specific I2C flag is set
 *
 * @param[in]       - pI2Cx: base address of the I2C peripheral
 * @param[in]       - FlagName: flag macro to be checked
 *
 * @return          - FLAG_SET or FLAG_RESET
 *
 * @Note            - none
 *
 */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName){
	if(pI2Cx == NULL){
		return FLAG_RESET;
	}

	if(pI2Cx->ISR & FlagName){
		return FLAG_SET;
	}

	return FLAG_RESET;
}

/*
 * IRQ Configuration and ISR Handling
 */
/****************************************************************************
 * @fn              - I2C_IRQInterruptConfig
 *
 * @brief           - This function enables or disables IRQ in NVIC
 *
 * @param[in]       - IRQNumber: IRQ number
 * @param[in]       - ENorDI: ENABLE or DISABLE
 *
 * @return          - none
 *
 * @Note            - none
 *
 */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t ENorDI){
	if(ENorDI == ENABLE){
		NVIC_ISER[IRQNumber / 32U] |= (1U << IRQNumber % 32U);
	}else if(ENorDI == DISABLE){
		NVIC_ICER[IRQNumber / 32U] |= (1U << IRQNumber % 32U);
	}else{
		//Invalid
		return;
	}
}

/****************************************************************************
 * @fn              - I2C_IRQPriorityConfig
 *
 * @brief           - This function configures IRQ priority
 *
 * @param[in]       - IRQNumber: IRQ number
 * @param[in]       - IRQPriority: priority value
 *
 * @return          - none
 *
 * @Note            - none
 *
 */
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint8_t IRQPriority){
    uint8_t iprx = IRQNumber / 4U;
    uint8_t iprx_section = IRQNumber % 4U;

    uint8_t shift_amount = (8U * iprx_section) + (8U - NVIC_PRIO_BITS_IMPLEMENTED);

    NVIC_IPR[iprx] &= ~(0xFU << shift_amount);
    NVIC_IPR[iprx] |= ((IRQPriority & 0xFU) << shift_amount);
}

//===============================================HELPERS================================================================

/*@fn				- I2C_ClearCR2TransferFields
 *@note				- CR2 Transfer Fields Clearing Function
 */
static void I2C_ClearCR2TransferFields(I2C_RegDef_t *pI2Cx){
    pI2Cx->CR2 &= ~((0x3FFU << I2C_CR2_SADD)    |
                    (1U    << I2C_CR2_RD_WRN)  |
                    (1U    << I2C_CR2_ADD10)   |
                    (0xFFU << I2C_CR2_NBYTES)  |
                    (1U    << I2C_CR2_RELOAD)  |
                    (1U    << I2C_CR2_AUTOEND));
}

/*@fn				- I2C_CheckAndClearErrors
 *@note				- I2C Error Check-Clear
 */
static uint8_t I2C_CheckAndClearErrors(I2C_RegDef_t *pI2Cx){
    if (I2C_GetFlagStatus(pI2Cx, I2C_FLAG_NACKF) == FLAG_SET){
        pI2Cx->ICR |= (1U << I2C_ICR_NACKCF);
        return I2C_ERROR_NACK;
    }

    if (I2C_GetFlagStatus(pI2Cx, I2C_FLAG_BERR) == FLAG_SET){
        pI2Cx->ICR |= (1U << I2C_ICR_BERRCF);
        return I2C_ERROR_BERR;
    }

    if (I2C_GetFlagStatus(pI2Cx, I2C_FLAG_ARLO) == FLAG_SET){
        pI2Cx->ICR |= (1U << I2C_ICR_ARLOCF);
        return I2C_ERROR_ARLO;
    }

    if (I2C_GetFlagStatus(pI2Cx, I2C_FLAG_OVR) == FLAG_SET){
        pI2Cx->ICR |= (1U << I2C_ICR_OVRCF);
        return I2C_ERROR_OVR;
    }

    return I2C_OK;
}

/*@fn				- I2C_WaitOnFlagUntilTimeout
 *@note				- I2C Timeout Function
 */
static uint8_t I2C_WaitOnFlagUntilTimeout(I2C_RegDef_t *pI2Cx, uint32_t FlagName, uint8_t DesiredStatus, uint32_t Timeout){
    uint8_t error_status;

    while (I2C_GetFlagStatus(pI2Cx, FlagName) != DesiredStatus){
        error_status = I2C_CheckAndClearErrors(pI2Cx);
        if (error_status != I2C_OK){
            return error_status;
        }

        if (Timeout-- == 0U){
            return I2C_ERROR_TIMEOUT;
        }
    }

    return I2C_OK;
}


/*@fn				- I2C_ConfigTransfer
 *@note				- I2C Configuration Transfer Function
 */
static void I2C_ConfigTransfer(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr, uint8_t Direction, uint32_t NBytes, uint8_t Reload, uint8_t AutoEnd) {
    I2C_ClearCR2TransferFields(pI2Cx);

    // 7-bit slave address (e.g: 0x3C, 0x68): Hardware expects it in SADD[7:1].
    // No 10-bit address support (05.06.2026)
    pI2Cx->CR2 |= ((uint32_t)(SlaveAddr & 0x7FU) << 1U);

    if (Direction == I2C_DIR_READ){
        pI2Cx->CR2 |= (1U << I2C_CR2_RD_WRN);
    } else if (Direction == I2C_DIR_WRITE){
        pI2Cx->CR2 &= ~(1U << I2C_CR2_RD_WRN);
    } else{
    	//Invalid config
    	return;
    }

    pI2Cx->CR2 |= ((NBytes & 0xFFU) << I2C_CR2_NBYTES);

    if (Reload == ENABLE){
        pI2Cx->CR2 |= (1U << I2C_CR2_RELOAD);
    }

    if (AutoEnd == ENABLE){
        pI2Cx->CR2 |= (1U << I2C_CR2_AUTOEND);
    }
}
//========================================END OF HELPERS===================================
